{
  "version": "https://jsonfeed.org/version/1",
  "title": "Read Rust - Security",
  "home_page_url": "https://readrust.net/",
  "feed_url": "https://readrust.net/security/feed.json",
  "description": "Security posts on Read Rust",
  "author": {
    "name": "Wesley Moore",
    "url": "http://www.wezm.net/"
  },
  "items": [
    {
      "id": "f1c4efc6-6cb3-4b03-a445-6ee32bd804b7",
      "title": "Noise Explorer",
      "content_text": "Noise Explorer is an online engine for reasoning about Noise Protocol Framework Handshake Patterns. Noise Explorer allows you to design and validate Noise Handshake Patterns, to generate cryptographic models for formal verification and to explore a compendium of formal verification results for the most popular and relevant Noise Handshake Patterns in use today.",
      "url": "https://noiseexplorer.com/",
      "date_published": "2019-03-29T00:50:00+00:00",
      "author": {
        "name": "georgio",
        "url": "https://noiseexplorer.com/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "de32ac99-9bcf-4744-ab65-3f22398433d7",
      "title": "BoringTun, a userspace WireGuard implementation in Rust",
      "content_text": "Today we are happy to release the source code of a project we’ve been working on for the past few months. It is called BoringTun, and is a userspace implementation of the WireGuard® protocol written in Rust.",
      "url": "https://blog.cloudflare.com/boringtun-userspace-wireguard-rust/",
      "date_published": "2019-03-27T13:43:27+00:00",
      "author": {
        "name": "Vlad Krasnov",
        "url": "https://blog.cloudflare.com/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "3f8f60fc-a917-4f77-98fb-f3d263cda7b3",
      "title": "Sequoia-PGP: State of the Seedling",
      "content_text": "I’d like to inform you about the recent progress on your favorite OpenPGP implementation. The Sequoia project made their first release at RustConf Rome during Neal’s talk (video, slides) about our experiences with Rust. The release includes only the low-level openpgp crate, which we renamed to sequoia-openpgp to avoid a namespace collision. In the weeks prior to the release, we moved a lot of code around, and refined our API. For example, we introduced a crypto module and moved all low-level crypto primitives there.",
      "url": "https://sequoia-pgp.org/blog/2018/12/10/state-of-the-seedling-in-december/",
      "date_published": "2018-12-10T13:50:35+01:00",
      "author": {
        "name": "Justus Winter",
        "url": "https://sequoia-pgp.org/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "e2a2559d-5bf2-45b6-ba62-a3af84913c3a",
      "title": "rust-audit: Know exact library versions used to build your Rust executable",
      "content_text": "Know exact library versions used to build your Rust executable. Audit binaries for known bugs or security vulnerabilities in production, at scale, with zero bookkeeping.",
      "url": "https://github.com/Shnatsel/rust-audit",
      "date_published": "2019-03-02T20:02:25+00:00",
      "author": {
        "name": "Sergey \"Shnatsel\" Davidoff",
        "url": "https://github.com/Shnatsel"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "f333987d-a697-4e1c-8667-7d6bd4e765de",
      "title": "Rust EDP: Build SGX enclaves in Rust",
      "content_text": "Secure enclaves provide an operating environment for code which is secure from interference by outside parties, including root users, malware, and the OS. This environment is built on three key pillars: Fully isolated execution, Sealing, Remote attestation. The Fortanix Enclave Development platform lets you write complete applications inside an enclave. The Fortanix EDP is fully integrated with the Rust compiler. Rust code that doesn't link to native libraries and that doesn't use processes or files should compile out of the box.",
      "url": "https://edp.fortanix.com/",
      "date_published": "2019-01-30T06:45:00+00:00",
      "author": {
        "name": "Jethro Beekman",
        "url": "https://twitter.com/JethroGB"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "fae48adb-0406-4124-b06d-6b9d7a667d85",
      "title": "Zero knowledge proofs using Bulletproofs",
      "content_text": "I will show how to create various zero knowledge proofs using the Bulletproofs implementation from dalek-cryptography. The examples will be i) proving knowledge of factors of a given number without revealing the factors, ii) a range proof, i.e. prove that you know a value x such that a ≤ x ≤ b without revealing x, iii) prove that the value you have is non-zero without revealing it (without using above range proof), iv) Set membership, i.e given a set S, prove that you know an element contained in the set without revealing the element, v) Similarly, set non-membership without revealing the value of the absent element. The examples can be adapted with little effort such that they can be used in ZK-SNARK implementations like libsnark or bellman.",
      "url": "https://medium.com/coinmonks/zero-knowledge-proofs-using-bulletproofs-4a8e2579fc82",
      "date_published": "2019-02-23T20:38:04.316+00:00",
      "author": {
        "name": "Lovesh Harchandani",
        "url": "https://medium.com/@loveshharchandani"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "1ffc5388-6476-4542-90c1-398c561a2c43",
      "title": "Implications of Rewriting a Browser Component in Rust",
      "content_text": "Since our first release in 2002, there have been 69 security bugs in Firefox’s style component. If we'd had a time machine and could have written this component in Rust from the start, 51% wouldn't have happened. That said, Rust is not foolproof. Developers still need to be aware of correctness bugs and data leakage attacks.",
      "url": "https://hacks.mozilla.org/2019/02/rewriting-a-browser-component-in-rust/",
      "date_published": "2019-02-28T14:10:27+00:00",
      "author": {
        "name": "Diane Hosfelt",
        "url": "https://hacks.mozilla.org/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "84b2eb06-712b-4d63-b899-c91e16e1b0ee",
      "title": "Manage security vulnerabilities in embedded IoT devices with Rust",
      "content_text": "The Rust programming language’s rich type system and ownership model guarantee memory-safety and thread-safety — and eliminate many classes of bugs and security vulnerabilities at compile-time.",
      "url": "https://medium.com/@flundstrom2/manage-security-vulnerabilities-in-embedded-iot-devices-with-rust-14aeabada68b",
      "date_published": "2019-01-23T12:18:11.800+00:00",
      "author": {
        "name": "Fredrik Lundström",
        "url": "https://medium.com/@flundstrom2"
      },
      "tags": [
        "Security",
        "Embedded"
      ]
    },
    {
      "id": "ba72d3fb-8f1e-4802-a55b-15dd8584046f",
      "title": "Medic: A Rust CLI that checks the passwords of a KeePass database",
      "content_text": "After the recent breach, I was curious to check my passwords against the list, but I’m a bit paranoid, so, rather than paste my passwords into the Have I Been Pwned website, I wanted to download the big text file and check my passwords against it offline, nice and safely.\n\nI use a password manager called KeePassXC, so all of my passwords are stored in an encrypted file – a KeePass database – and I use a program called KeePassXC, a free and open-source password manager, to manage them (I wrote a beginner’s user guide to KeePassXC a while back if you’re interested!). So ideally, to check my passwords against the big list, I’d have a tool that checks all the passwords in a given KeePass database against the entire HaveIBeenPwned list of passwords, preferably against the downloaded file (i.e. “offline”), rather than the API. In other words something similar to 1Password’s Watchtower feature, but preferably offline.\n\nAfter poking around a bit I decided to write it myself in Rust, with this script and this crate as useful references. Medic is a Rust CLI that can perform a variety of “health” checks on a KeePass database.",
      "url": "https://sts10.github.io/2019/02/01/medic.html",
      "date_published": "2019-02-01T01:15:00+00:00",
      "author": {
        "name": "Sam Schlinkert",
        "url": "https://sts10.github.io/"
      },
      "tags": [
        "Tools and Applications",
        "Security"
      ]
    },
    {
      "id": "e89d9e3f-1400-40ca-9e1c-d90817daf41e",
      "title": "Fearless Security: Memory Safety",
      "content_text": "Memory safety violations can cause programs to crash unexpectedly and can be exploited to alter intended behavior--languages can manage this multiple ways.",
      "url": "https://hacks.mozilla.org/2019/01/fearless-security-memory-safety/",
      "date_published": "2019-01-23T15:00:57+00:00",
      "author": {
        "name": "Diane Hosfelt",
        "url": "https://hacks.mozilla.org/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "b6ca1619-6bdb-4efc-a043-ea73ed0e8336",
      "title": "Auditing Rust Crypto: The First Hours",
      "content_text": "Checklists are a simple yet effective component of security and safety procedures in various fields, from flight safety and surgery to network security, and of course cryptography. So here’s a couple of things you want to check when starting the audit of a crypto software written in Rust.",
      "url": "https://research.kudelskisecurity.com/2019/02/07/auditing-rust-crypto-the-first-hours/",
      "date_published": "2019-02-07T14:00:15+00:00",
      "author": {
        "name": "https://research.kudelskisecurity.com/",
        "url": "JP Aumasson"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "a552df74-7e67-4b0a-9e12-a75afc9235b8",
      "title": "Be part of ANSSI’s new « Guide to develop secure applications with Rust »",
      "content_text": "Rust is an open source programming language which combines security, modernity and performance. As well, it is gradually being adopted in a large number of projects. To support developers, ANSSI offers a new \"Guide to develop secure applications with Rust\". This guide is intended to be a living document and it’s open to all contributions from the community. The object of this document is to provide hints and recommendations for secure applications development using the Rust programming language, that allow users to benefits of the good level of trust the Rust language already provides.",
      "url": "https://www.ssi.gouv.fr/en/actualite/be-part-of-anssis-new-guide-to-develop-secure-applications-with-rust/",
      "date_published": "2019-02-09T03:29:00+00:00",
      "author": {
        "name": "ANSSI",
        "url": "https://www.ssi.gouv.fr/en/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "2785bcea-bff1-46c3-913b-87888f79133c",
      "title": "Security as Rust 2019 goal",
      "content_text": "The goals and 2019 roadmap of Rust Secure Code Working Group",
      "url": "https://medium.com/@shnatsel/security-as-rust-2019-goal-6a060116ba39",
      "date_published": "2019-01-18T18:20:42.379+00:00",
      "author": {
        "name": "Sergey Davidoff et al.",
        "url": "https://medium.com/@shnatsel"
      },
      "tags": [
        "Rust 2019",
        "Security"
      ]
    },
    {
      "id": "01a84c85-f79f-42fa-9632-e3ee5f0f5b6e",
      "title": "Using TLS with Rust: Part II - Client authentication",
      "content_text": "The task that I have for now is to add client authentication via X509 client certificate. That is both obvious and non obvious, unfortunately. I’ll admit that I’m enjoying exploring Rust features, so I don’t know how idiomatic this code is, but it is certainly dense.",
      "url": "https://ayende.com/blog/185730-A/using-tls-with-rust-part-ii-client-authentication",
      "date_published": "2019-01-07T00:00:00+00:00",
      "author": {
        "name": "Ayende Rahien",
        "url": "https://ayende.com/blog/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "234e0c08-173d-431d-861b-3f4bbb214a6b",
      "title": "Using TLS with Rust: Part I",
      "content_text": "The next interesting step in my Rust network protocol exercise is to implement TLS. I haven’t looked at that yet, so it is going to be interesting.",
      "url": "https://ayende.com/blog/185698-A/using-tls-with-rust-part-i",
      "date_published": "2019-01-02T00:00:00+00:00",
      "author": {
        "name": "Ayende Rahien",
        "url": "https://ayende.com/blog/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "aa59c999-cba6-4f20-80cc-888e8e257a73",
      "title": "gbl: A typestate-powered zero-copy crate for GBL firmware update files",
      "content_text": "After a few weeks of reverse-engineering, internal dogfooding, and API design discussion, we're finally publishing our gbl crate for good.\n\nThe library implements a parser and writer for GBL firmware update containers, which are used to perform secure OTA updates for certain microcontrollers.",
      "url": "https://blog.1aim.com/post/gbl-release/",
      "date_published": "2018-12-19T00:00:00+00:00",
      "author": {
        "name": "Jonas Schievink",
        "url": "https://blog.1aim.com/"
      },
      "tags": [
        "Embedded",
        "Security"
      ]
    },
    {
      "id": "5d14453d-3a6f-4f26-8aa1-20edec9e9347",
      "title": "The Seedling Sees the Light of Day: Sequoia-PGP Initial Release",
      "content_text": "On October 16, 2017, we made the first commit to the Sequoia repository. Just over a year and a thousand commits later, Sequoia’s low-level API is nearly feature complete, and is already usable. For instance, a port of the p≡p engine to Sequoia is almost finished, and the code is significantly simpler than the version using the current OpenPGP library. We’ve also made experimental ports of other software that use OpenPGP, and written some new software to further validate the completeness and ergonomics of the API.",
      "url": "https://sequoia-pgp.org/blog/2018/11/26/initial-release/",
      "date_published": "2018-11-26T10:08:17+01:00",
      "author": {
        "name": "Neal H. Walfield, Justus Winter, and Kai Michaelis",
        "url": "https://sequoia-pgp.org/blog/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "b612b468-7306-4f7b-a09a-2b4f0bac5b55",
      "title": "Introducing Mundane, a new cryptography library for Rust",
      "content_text": "Mundane is a cryptography library written in Rust and backed by BoringSSL. It aims to be difficult to misuse, ergonomic, and performant (in that order). It was originally created to serve the cryptography needs of Fuchsia, but we’ve decided to split it off as a general-purpose crate.",
      "url": "https://joshlf.com/post/2018/11/06/introducing-mundane/",
      "date_published": "2018-11-06T00:00:00+00:00",
      "author": {
        "name": "Joshua Liebow-Feeser",
        "url": "https://joshlf.com/"
      },
      "tags": [
        "Security",
        "Crates"
      ]
    },
    {
      "id": "2e26b090-21b9-42e2-9ac5-9664e79af88e",
      "title": "Merlin: flexible, composable transcripts for zero-knowledge proofs",
      "content_text": "Merlin is a small Rust library that performs the Fiat-Shamir transformation in software, maintaining a STROBE-based transcript of the proof protocol and allowing the prover to commit messages to the transcript and compute challenges bound to all previous messages. It also provides a transcript-based RNG for use by the prover, generalizing “deterministic” and “synthetic” nonces to arbitrarily complex zero-knowledge protocols.",
      "url": "https://medium.com/@hdevalence/merlin-flexible-composable-transcripts-for-zero-knowledge-proofs-28d9fda22d9a",
      "date_published": "2018-09-28T21:07:20.750+00:00",
      "author": {
        "name": "Henry de Valence",
        "url": "https://medium.com/@hdevalence"
      },
      "tags": [
        "Crates",
        "Security"
      ]
    },
    {
      "id": "96405556-ac98-433a-a0f8-c3de068e47d3",
      "title": "‘orion’ - yet another attempt at pure-Rust cryptography",
      "content_text": "orion is another attempt at cryptography implemented in pure Rust. Its main focus is usability. This is in part achieved by providing a thorough documentation of the library. High-level abstractions are also provided, which are an attempt at guiding the users towards safe usage of the lower-level functionality of the library.",
      "url": "https://brycx.github.io/2018/09/25/orion-pure-rust-crypto-lib.html",
      "date_published": "2018-09-25T00:00:00+00:00",
      "author": {
        "name": "brycx",
        "url": "https://brycx.github.io/"
      },
      "tags": [
        "Crates",
        "Security"
      ]
    },
    {
      "id": "385cdc5a-e6e0-4562-b9f3-156b296d6a03",
      "title": "How I’ve found vulnerability in a popular Rust crate (and you can too)",
      "content_text": "I have recently discovered a zero-day vulnerability in a fairly popular and well-designed Rust crate. In this article I’m going to discuss how I did it and why it wasn’t discovered earlier, and introduce a new tool, libdiffuzz, that I’ve created for the job. A recently discovered vulnerability in Rust standard library makes a cameo appearance.",
      "url": "https://medium.com/@shnatsel/how-ive-found-vulnerability-in-a-popular-rust-crate-and-you-can-too-3db081a67fb",
      "date_published": "2018-09-28T03:51:45.283+00:00",
      "author": {
        "name": "Sergey \"Shnatsel\" Davidoff",
        "url": "https://medium.com/@shnatsel"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "e36be553-3461-4742-8127-2a41c9f54d93",
      "title": "Security advisory for the standard library (str::repeat)",
      "content_text": "The Rust team was recently notified of a security vulnerability affecting the standard library’s str::repeat function. When passed a large number this function has an integer overflow which can lead to an out of bounds write. If you are not using str::repeat, you are not affected.",
      "url": "https://blog.rust-lang.org/2018/09/21/Security-advisory-for-std.html",
      "date_published": "2018-09-21T00:00:00+00:00",
      "author": {
        "name": "The Rust Core Team",
        "url": "https://blog.rust-lang.org/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "2fec1872-4519-4b08-8012-147db9dff5e0",
      "title": "Postgres over TLS with postgres and r2d2_postgres",
      "content_text": "In this post we’ll go over how to get the postgres crate and r2d2_postgres working with openssl for connection pooling with TLS.",
      "url": "https://matthewkmayer.github.io/blag/public/post/postgres-tls/",
      "date_published": "2018-09-13T00:00:00+00:00",
      "author": {
        "name": "Matthew Mayer's",
        "url": "https://matthewkmayer.github.io/blag/public"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "2e015136-8213-4fa3-afe0-78bf520d1da6",
      "title": "Transparent encryption and decryption in rust with cryptostreams",
      "content_text": "The rust community has fortunately adopted the OpenSSL bindings as the approach of choice, and the rust-openssl crate makes it easy to both bundle and consume the openssl bindings from rust in a cross-platform manner. What it doesn’t do is make encryption and decryption any easier than OpenSSL itself does.\n\nEnter the cryptostream crate. Released on github and on crates.io under the MIT public license, cryptostream finally provides an easy and transparent way to add encryption and decryption to pipelines involving objects implementing Read or Write, making encryption (or decryption) as easy as creating a new cryptostream object, passing in an existing Read/Write impl, and then reading/writing from/to the cryptostream instead.",
      "url": "https://neosmart.net/blog/2018/transparent-encryption-and-decryption-in-rust-with-cryptostreams/",
      "date_published": "2018-09-12T23:35:55+00:00",
      "author": {
        "name": "Mahmoud Al-Qudsi",
        "url": "https://neosmart.net/blog/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "7f4b6826-72f6-4842-882d-2a2e5378bdcd",
      "title": "How Rust’s standard library was vulnerable for years and nobody noticed",
      "content_text": "Rust is a new systems programming language that prides itself on memory safety and speed. The gist of it is that if you write code in Rust, it goes as fast as C or C++, but you will not get mysterious intermittent crashes in production or horrific security vulnerabilities, unlike in the latter two.\n\nThat is, until you explicitly opt in to that kind of thing. Uh oh.",
      "url": "https://medium.com/@shnatsel/how-rusts-standard-library-was-vulnerable-for-years-and-nobody-noticed-aebf0503c3d6",
      "date_published": "2018-08-18T02:47:33.708+00:00",
      "author": {
        "name": "Sergey \"Shnatsel\" Davidoff",
        "url": "https://medium.com/@shnatsel"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "be4fb7bc-7b10-41ce-af58-e877d70fd73d",
      "title": "Software Security is a Programming Languages Issue",
      "content_text": "This is the the last of three posts on the course I regularly teach, CS 330, Organization of Programming Languages. The first two posts covered programming language styles and mathematical concepts. This post covers the last 1/4 of the course, which focuses on software security, and related to that, the programming language Rust.",
      "url": "http://www.pl-enthusiast.net/2018/08/13/security-programming-languages-issue/",
      "date_published": "2018-08-13T18:00:43+00:00",
      "author": {
        "name": "Michael Hicks",
        "url": "http://www.pl-enthusiast.net/"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "31c9d3c0-192b-45f2-922e-5b8d188683bc",
      "title": "Xori - Custom disassembly framework",
      "content_text": "Xori is an automation-ready disassembly and static analysis library that consumes shellcode or PE binaries and provides triage analysis data.",
      "url": "https://sites.google.com/secured.org/malwareunicorn/xori",
      "date_published": "2018-08-09T08:23:00+00:00",
      "author": {
        "name": "Amanda Rousseau and Rich Seymour",
        "url": "https://sites.google.com/secured.org/malwareunicorn/xori"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "8a924e9f-d803-4e85-b2e8-92b5909c7695",
      "title": "Accelerating Edwards Curve Arithmetic with Parallel Formulas",
      "content_text": "The fastest formulas for elliptic curve operations were published by Hisil, Wong, Carter, and Dawson in their 2008 paper Twisted Edwards Curves Revisited. Their paper also describes a parallel version of their formulas, designed to execute four streams of instructions on four independent processors. Until now, these parallel formulas don’t seem to have been implemented in software. But a closer look reveals that slightly modifying the formulas allows the expensive instructions to be executed in uniform, making a vectorized SIMD implementation possible.\n\nI implemented this strategy in Rust, targeting 256-bit wide AVX2 operations. The resulting implementation performs double-base scalar multiplication faster than other Ed25519 implementations I tested, and is even faster than FourQ without endomorphisms",
      "url": "https://medium.com/@hdevalence/accelerating-edwards-curve-arithmetic-with-parallel-formulas-ac12cf5015be",
      "date_published": "2018-08-01T17:41:42.002+00:00",
      "author": {
        "name": "Henry de Valence",
        "url": "https://medium.com/@hdevalence"
      },
      "tags": [
        "Security"
      ]
    },
    {
      "id": "db3cdc15-004b-4a41-9649-6ade4a8407eb",
      "title": "RustSec Advisory Database",
      "content_text": "Security advisory database for Rust crates published through https://crates.io.",
      "url": "https://rustsec.org/",
      "date_published": "2018-07-19T00:00:00+00:00",
      "author": {
        "name": "Rust Project Developers",
        "url": "https://rustsec.org/"
      },
      "tags": [
        "Security"
      ]
    }
  ]
}